In [1]:
import numpy as np
import pandas as pd
from thefuzz import fuzz
from thefuzz import process

In [2]:
df=pd.read_csv('base_names.csv')
df1=pd.read_csv('name_variations.csv')

In [8]:
df.head()

   Base_Name_ID         Base_Name
0             1        John Smith
1             2    Jennifer Brown
2             3  Michael O'Connor
3             4      Maria Garcia
4             5        Robert Lee

In [9]:
df1.head()

      Variation Matches_With_Base_Name         match
0  Thomas  King            Thomas King   Thomas King
1    ThomasKing            Thomas King   Thomas King
2  Maria Garcia           Maria Garcia  Maria Garcia
3     MaryLewis             Mary Lewis    Mary Lewis
4      Nancy W.           Nancy Wright  Nancy Wright

In [5]:
matched_results = []

base_names = df['Base_Name'].tolist()

for variation in df1['Variation']:
    match = process.extractOne(variation, base_names, scorer=fuzz.partial_ratio)
    matched_results.append(match[0])  

df1["match"]=matched_results

df1

          Variation Matches_With_Base_Name           match
0      Thomas  King            Thomas King     Thomas King
1        ThomasKing            Thomas King     Thomas King
2      Maria Garcia           Maria Garcia    Maria Garcia
3         MaryLewis             Mary Lewis      Mary Lewis
4          Nancy W.           Nancy Wright    Nancy Wright
..              ...                    ...             ...
95  Jennifer- Brown         Jennifer Brown  Jennifer Brown
96    Daniel- Scott           Daniel Scott    Daniel Scott
97         David M.         David Martinez  David Martinez
98      Paul Allen.             Paul Allen      Paul Allen
99      Paul  Allen             Paul Allen      Paul Allen

[100 rows x 3 columns]

In [6]:
sum = np.sum(df1['match'] == df1['Matches_With_Base_Name'])

In [7]:

accuracy = sum/len(df1) * 100
accuracy

100.0